{
  "major_moon_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Emotions and identity are deeply aligned. This creates internal unity and strong instinctual clarity, but can also lead to difficulty distinguishing feelings from self-concept.",
    "growth": "Develop self-reflection to avoid emotional bias. Strength lies in your natural congruence, but wisdom comes from stepping outside yourself, too."
  },
  "major_moon_sun_square": {
    "aspect_type": "Square",
    "psychology": "There is tension between inner emotions and conscious identity. You may feel torn between what you feel and what you show, leading to internal conflict or impulsive mood shifts.",
    "growth": "Integrate opposing needs by allowing both emotional truth and personal responsibility to coexist."
  },
  "major_moon_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "Your emotional nature and identity flow easily together. There's a natural rhythm to your expression, and inner harmony is a strength.",
    "growth": "Use this ease to support others, but don’t avoid challenge — growth often lies beyond comfort."
  },
  "major_moon_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "This aspect reflects a lifelong balancing act between emotional needs and ego identity. It may create push-pull dynamics in relationships and self-perception.",
    "growth": "Practice emotional awareness without self-judgment. Wholeness comes from accepting duality."
  },
  "major_moon_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "This aspect brings gentle cooperation between feelings and identity. Emotional understanding supports your goals and self-expression.",
    "growth": "This ease gives you influence — use it to uplift others, especially in emotional settings."
  },
  "major_mercury_moon_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Emotional expression and thought are tightly woven. You think with feeling and communicate from the heart.",
    "growth": "Learn to step back when emotionally charged. Cultivate clarity before you speak."
  },
  "major_mercury_moon_square": {
    "aspect_type": "Square",
    "psychology": "Thoughts and feelings compete. You may struggle to articulate emotions clearly or overthink emotional situations.",
    "growth": "Practice emotional literacy. Journaling or creative writing can help bridge the inner gap."
  },
  "major_mercury_moon_trine": {
    "aspect_type": "Trine",
    "psychology": "Feelings and thoughts move fluidly together. You're emotionally articulate and attuned to others’ needs.",
    "growth": "Share your sensitivity. You can teach others by expressing your emotional truth with clarity."
  },
  "major_mercury_moon_opposition": {
    "aspect_type": "Opposition",
    "psychology": "Your logic may clash with emotional instincts. Others may perceive you as inconsistent or hard to read.",
    "growth": "Embrace both logic and intuition — give each a voice before making important decisions."
  },
  "major_mercury_moon_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You’re emotionally perceptive and a thoughtful communicator. Emotions support your reasoning.",
    "growth": "Your gift is emotional clarity — use it to help others speak what they feel but can't yet name."
  },
  "major_moon_venus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Soft-hearted and aesthetically sensitive. Emotional fulfillment is tied to connection, beauty, and comfort.",
    "growth": "Balance emotional harmony with self-respect. Avoid pleasing others at the cost of your own peace."
  },
  "major_moon_venus_square": {
    "aspect_type": "Square",
    "psychology": "Emotional needs and relational desires pull in different directions. You may attract love that doesn't nourish.",
    "growth": "Explore your values. Choose love that aligns with your emotional truth, not just desire."
  },
  "major_moon_venus_trine": {
    "aspect_type": "Trine",
    "psychology": "Love and emotional security go hand in hand. You're naturally nurturing, graceful, and affectionate.",
    "growth": "Your warmth is a gift. Offer it freely, but be mindful not to overextend or blur emotional boundaries."
  },
  "major_moon_venus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may experience emotional highs and lows in love. There can be tension between intimacy and independence.",
    "growth": "Practice self-love and balance giving with receiving. Real love begins within."
  },
  "major_moon_venus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You're emotionally gracious and attuned to beauty. Relationships tend to be soothing and mutually supportive.",
    "growth": "Share your kindness, but ensure it flows from fullness — not a need to be needed."
  },
  "major_mars_moon_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Emotions and action are fused. You feel passionately and act on impulse. There’s courage and intensity.",
    "growth": "Channel your emotional fire constructively. Learn to pause before reacting."
  },
  "major_mars_moon_square": {
    "aspect_type": "Square",
    "psychology": "Inner tension between need and will. Emotions may erupt as frustration or emotional defensiveness.",
    "growth": "Practice somatic awareness. Move your body and breathe deeply before speaking when triggered."
  },
  "major_mars_moon_trine": {
    "aspect_type": "Trine",
    "psychology": "You're assertive and emotionally courageous. You express needs with clarity and confidence.",
    "growth": "Let your boldness inspire others — especially those afraid to speak their truth."
  },
  "major_mars_moon_opposition": {
    "aspect_type": "Opposition",
    "psychology": "Emotional needs and aggressive urges pull against each other. You may feel inner conflict around vulnerability.",
    "growth": "Learn to differentiate strength from reactivity. True power includes softness."
  },
  "major_mars_moon_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Emotions flow into motivation. You take initiative from a place of feeling.",
    "growth": "Use your emotional drive to lead with empathy and passion. You're a quiet storm — steady, yet strong."
  },
  "major_jupiter_moon_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Emotions are expansive and optimistic. There's a natural generosity of feeling and an urge to nurture on a grand scale.",
    "growth": "Practice discernment in emotional giving. Boundaries help you sustain your natural benevolence."
  },
  "major_jupiter_moon_square": {
    "aspect_type": "Square",
    "psychology": "Emotional responses can be exaggerated. There may be over-idealism or a tendency to avoid discomfort through positivity.",
    "growth": "Balance your expansive feelings with grounded presence. Let optimism rise from depth, not avoidance."
  },
  "major_jupiter_moon_trine": {
    "aspect_type": "Trine",
    "psychology": "A joyful connection to life and a big emotional heart. You naturally uplift others with emotional wisdom and ease.",
    "growth": "Share your emotional abundance wisely. Guide others without absorbing their weight."
  },
  "major_jupiter_moon_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may feel torn between emotional simplicity and the urge to take on too much emotionally or socially.",
    "growth": "Learn to say no with love. Self-containment is an act of emotional maturity."
  },
  "major_jupiter_moon_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Your emotions support growth and connection. There’s a harmonious relationship between heart and vision.",
    "growth": "Use your emotional intelligence to support causes and inspire hope in others."
  },
  "major_moon_saturn_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You may appear emotionally reserved or stoic. Emotional safety was learned through control or caution.",
    "growth": "Soften without losing structure. Emotional maturity blossoms when you let yourself feel deeply."
  },
  "major_moon_saturn_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with emotional restriction or fear of vulnerability. A deep need for control can block intimacy.",
    "growth": "Gently reparent yourself. Trust that it's safe to feel and express emotion without judgment."
  },
  "major_moon_saturn_trine": {
    "aspect_type": "Trine",
    "psychology": "Stable emotional grounding. You’re reliable and calm under pressure, with a mature emotional presence.",
    "growth": "Let others into your calm. Your inner peace can be a lighthouse — offer it generously."
  },
  "major_moon_saturn_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may feel caught between emotional openness and self-protection. Security needs clash with relational vulnerability.",
    "growth": "Honor both your need for safety and your longing for closeness. Let time and trust be your bridge."
  },
  "major_moon_saturn_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You blend emotional sensitivity with practicality. A quiet strength supports long-term emotional stability.",
    "growth": "Use this blend to guide others gently through challenge. Your steadiness is sacred."
  },
  "major_moon_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Emotions are unpredictable and electric. You may feel different from others — emotionally ahead of your time.",
    "growth": "Embrace your uniqueness, but anchor yourself. Freedom and intimacy can coexist with care."
  },
  "major_moon_uranus_square": {
    "aspect_type": "Square",
    "psychology": "Emotional volatility may lead to distancing or rebellious behavior. There’s tension between connection and independence.",
    "growth": "Build emotional freedom with consistency. Spontaneity can flourish within a rooted self."
  },
  "major_moon_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "Emotional insight comes in flashes. You’re intuitive, creative, and open to change.",
    "growth": "Inspire others with your emotional originality. Lead from the heart, not the shock."
  },
  "major_moon_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may swing between emotional closeness and sudden detachment. Freedom and intimacy may feel at odds.",
    "growth": "Develop secure independence. Emotional freedom doesn’t require isolation."
  },
  "major_moon_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You bring fresh emotional perspectives. Your feelings are innovative and forward-looking.",
    "growth": "Use your intuitive breakthroughs to uplift collective healing and vision."
  },
  "major_moon_neptune_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Dreamy, mystical emotions. You may absorb others' feelings easily, and imagination runs deep.",
    "growth": "Ground your empathy. Emotional boundaries make your compassion more powerful."
  },
  "major_moon_neptune_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with emotional clarity. There can be fantasy-prone reactions or a tendency to idealize others.",
    "growth": "Anchor your heart in reality. Clear feelings from projections through solitude or ritual."
  },
  "major_moon_neptune_trine": {
    "aspect_type": "Trine",
    "psychology": "A naturally empathic and intuitive soul. Emotions are artistic, spiritual, and fluid.",
    "growth": "Express your heart through music, art, or healing. You touch others through your tenderness."
  },
  "major_moon_neptune_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may feel confused about emotional identity, or struggle with boundaries in relationships.",
    "growth": "Strengthen self-trust through stillness and solitude. Let clarity rise like mist clearing at dawn."
  },
  "major_moon_neptune_sextile": {
    "aspect_type": "Sextile",
    "psychology": "A spiritual and emotionally attuned nature. You relate through compassion and subtle sensing.",
    "growth": "Use your intuitive empathy in service — but always recharge through sacred silence."
  },
  "major_moon_pluto_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your emotions run deep and intense. You feel everything fully — powerfully, painfully, profoundly.",
    "growth": "Learn to transform without self-destruction. Your emotional alchemy is your true gift."
  },
  "major_moon_pluto_square": {
    "aspect_type": "Square",
    "psychology": "Emotional power struggles or fears of abandonment may dominate your inner life. Control and vulnerability collide.",
    "growth": "Explore your emotional shadow without shame. Healing lies in surrender, not force."
  },
  "major_moon_pluto_trine": {
    "aspect_type": "Trine",
    "psychology": "You have a gift for emotional transformation. Your presence holds depth and psychic wisdom.",
    "growth": "Be a channel for healing — your emotional gravity helps others evolve."
  },
  "major_moon_pluto_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may attract intense emotional dynamics. There’s a magnetic pull toward emotional extremes.",
    "growth": "Balance emotional power with tenderness. Your strength lies in your capacity to transmute pain."
  },
  "major_moon_pluto_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You navigate depth with grace. Emotions are powerful, yet controlled. A natural healer's touch.",
    "growth": "Offer your emotional insight in spaces that need rebirth. You are a catalyst for change."
  },
  "major_chiron_moon_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your emotional wound is close to the surface. You may feel hypersensitive or maternal toward others' pain.",
    "growth": "Your tenderness is sacred. Nurture yourself the way you long to nurture others."
  },
  "major_chiron_moon_square": {
    "aspect_type": "Square",
    "psychology": "Old emotional pain resurfaces in daily life. You may feel unworthy of love or wary of trusting.",
    "growth": "Gently confront your inner child’s voice. Emotional courage heals what time cannot."
  },
  "major_chiron_moon_trine": {
    "aspect_type": "Trine",
    "psychology": "You carry healing wisdom in your emotional responses. Your empathy helps others feel seen and held.",
    "growth": "Teach through compassion — your scars have become your medicine."
  },
  "major_chiron_moon_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may project emotional wounding onto others or attract those who reflect your pain.",
    "growth": "Reclaim your emotions without blame. Your healing begins where you stop outsourcing it."
  },
  "major_chiron_moon_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You’re emotionally wise, with a quiet ability to nurture and heal. Pain becomes purpose.",
    "growth": "Hold space for others, but remember to offer that same healing to yourself."
  },
  "major_mercury_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "The mind and ego work closely together. This brings clarity of thought and strong self-expression, but may limit objectivity.",
    "growth": "Listen as much as you speak. True intelligence includes the ability to receive as well as broadcast."
  },
  "major_mercury_sun_square": {
    "aspect_type": "Square",
    "psychology": "Your thoughts and self-expression may clash. You could feel misunderstood or too reactive in conversation.",
    "growth": "Slow down. Integrate intellect and identity before responding. Presence is your ally."
  },
  "major_mercury_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "Communication flows smoothly. You express your ideas with confidence and clarity, often inspiring others.",
    "growth": "Use your voice for empowerment. Teaching, storytelling, or writing can become vehicles of truth."
  },
  "major_mercury_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may experience tension between your self-image and how your mind processes the world. Doubts can challenge your confidence.",
    "growth": "Learn to appreciate your inner dialogue. Duality breeds depth — not division."
  },
  "major_mercury_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You think clearly and speak with purpose. Communication often serves your identity or career goals.",
    "growth": "Let your words carry vision, not just information. Speak with soul."
  },
  "major_sun_venus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "A harmonious and artistic self-expression. You often seek love, beauty, or approval as part of your identity.",
    "growth": "Express your charm authentically. You shine brightest when love radiates inward first."
  },
  "major_sun_venus_square": {
    "aspect_type": "Square",
    "psychology": "There may be conflict between your ego needs and your desire for connection. Self-worth and relationships may clash.",
    "growth": "Align your self-love with your values. The right people will meet you where your truth begins."
  },
  "major_sun_venus_trine": {
    "aspect_type": "Trine",
    "psychology": "You carry natural magnetism and grace. There's an ease in social settings and aesthetic sensibility.",
    "growth": "Use your radiance in service — beauty becomes healing when shared."
  },
  "major_sun_venus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may alternate between self-focus and relational need. Intimacy can challenge your sense of independence.",
    "growth": "Explore how self-expression and connection feed each other. Wholeness includes both."
  },
  "major_sun_venus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You harmonize your need to shine with a genuine desire to connect. Love and creativity flow through your presence.",
    "growth": "Let connection become part of your expression — not a performance."
  },
  "major_mars_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Assertiveness is central to your identity. You are confident, direct, and naturally take initiative.",
    "growth": "Balance courage with compassion. Leadership matures through empathy."
  },
  "major_mars_sun_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with impulsiveness or ego-driven actions. Frustration arises when you feel blocked.",
    "growth": "Cultivate self-awareness. You’re powerful when you move with intention, not just instinct."
  },
  "major_mars_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "You act decisively and with inner alignment. Confidence is a gift — action feels natural and inspired.",
    "growth": "Lead by example. Your authenticity motivates others more than any effort to prove."
  },
  "major_mars_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "There’s tension between ego and action. You may feel torn between assertion and passivity, or overcorrect in either direction.",
    "growth": "Embrace constructive conflict. Balance willpower with patience and perspective."
  },
  "major_mars_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You bring steady action to your goals. Energy supports your purpose without force.",
    "growth": "Trust your pace. You’re not slow — you’re precise."
  },
  "major_jupiter_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your identity expands through optimism, faith, and growth. You radiate confidence and often feel called to something greater.",
    "growth": "Balance vision with humility. Your natural luck grows when grounded in gratitude."
  },
  "major_jupiter_sun_square": {
    "aspect_type": "Square",
    "psychology": "Your desire to grow or be admired may outpace your actual direction. Overconfidence or indulgence can block growth.",
    "growth": "Temper ambition with wisdom. True success is sustainable and inclusive."
  },
  "major_jupiter_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "You possess an inspiring and generous spirit. People may see you as uplifting, philosophical, or expansive.",
    "growth": "Let your confidence create space for others to shine. Leadership is shared light."
  },
  "major_jupiter_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may feel torn between grounded identity and a thirst for more — more knowledge, adventure, success.",
    "growth": "Integrate humility with your ambitions. Purpose is more powerful than praise."
  },
  "major_jupiter_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You harmonize your purpose with positive growth. Optimism supports your drive without overpowering it.",
    "growth": "Use your hopeful energy to uplift collective causes. You grow through what you give."
  },
  "major_saturn_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "A serious sense of self. You define identity through responsibility, structure, or legacy.",
    "growth": "Let your structure hold space for soul. There is wisdom in softness."
  },
  "major_saturn_sun_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with self-worth or harsh inner judgment. Pressure to prove yourself can lead to burnout.",
    "growth": "Practice self-compassion. Your value is not tied to output — it’s intrinsic."
  },
  "major_saturn_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "Discipline and purpose flow naturally. You’re dependable, ambitious, and capable of sustained effort.",
    "growth": "Trust your inner authority. Lead quietly, but with conviction."
  },
  "major_saturn_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "There’s tension between your desire to express yourself and the limits or fears you carry.",
    "growth": "Honor your structure without letting it become a cage. Let discipline support, not suppress, your light."
  },
  "major_saturn_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Responsibility supports identity. You grow steadily and gain respect through consistency.",
    "growth": "Help others build what lasts. Your quiet confidence creates trust."
  },
  "major_sun_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You’re an individualist. Identity forms through innovation, rebellion, or uniqueness. You’re electric, original, and sometimes unpredictable.",
    "growth": "Find freedom through rootedness. You don’t need to shock to shine."
  },
  "major_sun_uranus_square": {
    "aspect_type": "Square",
    "psychology": "A restless spirit may reject conformity, even at your own expense. Authority clashes are likely.",
    "growth": "Learn when to break the mold and when to refine it. Discipline turns disruption into transformation."
  },
  "major_sun_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "You shine by being different. Your identity is infused with innovation, and you thrive when allowed to evolve.",
    "growth": "Use your originality for meaningful change. You’re here to disrupt with love."
  },
  "major_sun_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may swing between conventional expression and a need for radical freedom.",
    "growth": "Integrate your wildness with your purpose. True freedom includes direction."
  },
  "major_sun_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Your individuality supports your identity. You innovate within structure and inspire fresh paths.",
    "growth": "Let your inner visionary help others break free from limiting roles."
  },
  "major_neptune_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your identity is infused with dream, vision, or compassion. You may have a mystical presence or struggle with illusion.",
    "growth": "Ground your ideals. Boundaries clarify your gifts."
  },
  "major_neptune_sun_square": {
    "aspect_type": "Square",
    "psychology": "There may be confusion about purpose or self-image. Idealism could lead to disillusionment or avoidance.",
    "growth": "Clarify your intentions. Let your dreams guide, not cloud, your direction."
  },
  "major_neptune_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "You carry a creative or spiritual grace. Your identity merges naturally with imagination or healing.",
    "growth": "Use your vision to bring beauty or peace into the world — art, service, or soul work."
  },
  "major_neptune_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may alternate between egoic assertion and total surrender. Clarity around identity can be elusive.",
    "growth": "Trust your intuition without losing your center. Anchor your soul in presence."
  },
  "major_neptune_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You blend self-expression with idealism. There's sensitivity and soul in how you move through life.",
    "growth": "Create rituals or routines that ground your mysticism into practice."
  },
  "major_pluto_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your identity is forged in transformation. You exude intensity, purpose, and an innate sense of power.",
    "growth": "Use your power wisely. Let rebirth become your art form."
  },
  "major_pluto_sun_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with control or power dynamics. Ego battles can arise internally or with authority figures.",
    "growth": "Surrender without collapse. Transformation begins where control ends."
  },
  "major_pluto_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "You hold deep personal power. Authenticity and intensity flow through your actions.",
    "growth": "Lead others through your truth — not force. Power becomes sacred when shared."
  },
  "major_pluto_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may face extremes in your personal journey. There’s a tug-of-war between ego expression and evolutionary change.",
    "growth": "Integrate both — power and humility, depth and light. Transformation is your soul’s invitation."
  },
  "major_pluto_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You access deep willpower and resilience. Identity is strengthened through navigating life's depths.",
    "growth": "Channel your inner strength to uplift others. Your presence empowers transformation."
  },
  "major_chiron_sun_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your sense of self is woven with a deep inner wound. This can make you both highly sensitive and profoundly wise.",
    "growth": "Turn your pain into purpose. You were made to embody the healing you seek."
  },
  "major_chiron_sun_square": {
    "aspect_type": "Square",
    "psychology": "You may doubt your value or overcompensate through performance. Early wounds may challenge your self-worth.",
    "growth": "Embrace your flaws as sacred. You teach others by being real, not perfect."
  },
  "major_chiron_sun_trine": {
    "aspect_type": "Trine",
    "psychology": "You carry quiet wisdom and dignity through your scars. Healing flows naturally through your presence.",
    "growth": "Let your journey be visible. Vulnerability becomes leadership."
  },
  "major_chiron_sun_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may externalize your wounds, attracting situations that reflect your healing path.",
    "growth": "Reclaim your reflection. Others show you what you’re ready to integrate."
  },
  "major_chiron_sun_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You integrate healing into your self-expression. Pain becomes insight — and insight becomes light.",
    "growth": "Use your gifts in quiet service. You help others feel seen just by being whole."
  },
  "major_mercury_venus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your words carry grace. Thought and affection are fused — you may speak beautifully or enjoy harmony in dialogue.",
    "growth": "Let your voice be a bridge, not a performance. Connection is your communication gift."
  },
  "major_mercury_venus_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle to say what you mean in relationships. Logic and emotion clash in your expression of love.",
    "growth": "Align your values with your speech. Honesty with kindness is your medicine."
  },
  "major_mercury_venus_trine": {
    "aspect_type": "Trine",
    "psychology": "A pleasant, artistic mind. You're charming, diplomatic, and thoughtful — with a gift for writing or design.",
    "growth": "Use your voice to soften hearts or beautify spaces. You make harmony tangible."
  },
  "major_mercury_venus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "There may be tension between what you think and how you relate. You may over-rationalize emotions or speak to please.",
    "growth": "Speak from your values. Let love guide your logic."
  },
  "major_mercury_venus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Your mind and heart work together. You’re likely a supportive communicator and emotionally intelligent partner.",
    "growth": "Use your gift for empathy to help others speak their truth."
  },
  "major_mars_mercury_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Quick mind, sharp tongue. You think and act fast, but may speak before reflecting.",
    "growth": "Channel your sharpness into clarity, not combat. Precision is more powerful than speed."
  },
  "major_mars_mercury_square": {
    "aspect_type": "Square",
    "psychology": "There may be tension between mental impulse and verbal aggression. You may react sharply when triggered.",
    "growth": "Use breath to regulate before speaking. You gain influence by calming the fire before expression."
  },
  "major_mars_mercury_trine": {
    "aspect_type": "Trine",
    "psychology": "You speak with conviction and think with courage. Ideas become action easily.",
    "growth": "Inspire others through clarity and passion. Your words carry direction."
  },
  "major_mars_mercury_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may experience inner tension between saying what you mean and fearing its impact.",
    "growth": "Speak your truth, but listen too. Harmony grows through dialogue, not defense."
  },
  "major_mars_mercury_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You combine sharp thinking with initiative. This is a strategist’s aspect — precise and proactive.",
    "growth": "Use your clarity to organize or guide. Your ideas deserve direction."
  },
  "major_jupiter_mercury_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "A big-picture thinker with a love for learning and philosophy. Words may be uplifting or verbose.",
    "growth": "Speak with humility and curiosity. Your wisdom expands when grounded in listening."
  },
  "major_jupiter_mercury_square": {
    "aspect_type": "Square",
    "psychology": "Your mind may jump ahead of facts. There’s a tension between detail and vision, leading to exaggeration or overwhelm.",
    "growth": "Balance the zoom lens with focus. Truth includes both context and precision."
  },
  "major_jupiter_mercury_trine": {
    "aspect_type": "Trine",
    "psychology": "Optimistic, inspired, and articulate. You communicate with purpose and often uplift others through language.",
    "growth": "Your message matters — anchor it in service, not just ideas."
  },
  "major_jupiter_mercury_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may toggle between knowing too much and saying too little. There’s a pull between curiosity and certainty.",
    "growth": "Let your questions guide you. Don’t confuse confidence with conclusion."
  },
  "major_jupiter_mercury_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Expansive thinking supports your goals. You’re likely a teacher, guide, or expressive thinker.",
    "growth": "Let your mind carry meaning. Purpose powers your words."
  },
  "major_mercury_saturn_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "A serious mind. You may be methodical, cautious, or hard on your own thoughts.",
    "growth": "Build your voice with patience. Thought becomes wisdom through structure and time."
  },
  "major_mercury_saturn_square": {
    "aspect_type": "Square",
    "psychology": "Self-doubt may cloud your thinking. You might struggle to communicate confidently or feel blocked mentally.",
    "growth": "Your mind is not broken — it's building. Let resilience become your mental rhythm."
  },
  "major_mercury_saturn_trine": {
    "aspect_type": "Trine",
    "psychology": "You’re structured, reliable, and clear in speech. Others trust your words because they’re earned.",
    "growth": "Use your logic to support long-term goals. You bring language to legacy."
  },
  "major_mercury_saturn_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may feel torn between trusting your thoughts and fearing judgment. Early criticism may echo.",
    "growth": "Reclaim your voice without needing it to be perfect. Wisdom comes through practice, not protection."
  },
  "major_mercury_saturn_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You think with clarity and responsibility. A blend of intellect and realism guides your ideas.",
    "growth": "Teach with structure. Others benefit from your clear thinking."
  },
  "major_mercury_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your mind is sharp, unconventional, and often ahead of its time. Ideas arrive like lightning — sudden, brilliant, and sometimes disruptive.",
    "growth": "Balance genius with grounding. Let innovation flow, but build systems to support it."
  },
  "major_mercury_uranus_square": {
    "aspect_type": "Square",
    "psychology": "You may speak impulsively or rebel against conventional thinking. Mental restlessness can lead to scattered focus.",
    "growth": "Learn when to break the mold and when to refine it. Discipline turns disruption into transformation."
  },
  "major_mercury_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "You are a futuristic thinker, naturally open to change and originality. You thrive on insight and mental freedom.",
    "growth": "Use your progressive thinking to challenge systems, not just people. Lead with clarity."
  },
  "major_mercury_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "There’s tension between innovative ideas and grounded communication. You may toggle between brilliance and disconnection.",
    "growth": "Let your wild ideas be tested. Coherence empowers your originality."
  },
  "major_mercury_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You bring originality to your words. A natural innovator, you blend insight with intuition.",
    "growth": "Apply your mind to bold ideas. Change begins with a question well asked."
  },
  "major_mercury_neptune_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your mind is dreamy, poetic, and deeply imaginative. You may be a visionary, but vulnerable to confusion or fantasy.",
    "growth": "Ground your inspiration. Structure enhances your creativity."
  },
  "major_mercury_neptune_square": {
    "aspect_type": "Square",
    "psychology": "There may be fog in your thinking or speech. Miscommunication, illusion, or self-deception are risks.",
    "growth": "Practice clear boundaries in speech and thought. Your imagination is powerful — aim it wisely."
  },
  "major_mercury_neptune_trine": {
    "aspect_type": "Trine",
    "psychology": "Your thoughts carry magic. You blend logic with intuition, and often channel creative or spiritual truths.",
    "growth": "Trust your inner voice — but check the facts when needed. You bridge worlds."
  },
  "major_mercury_neptune_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may doubt your thinking or fall into mental escapism. Idealism competes with logic.",
    "growth": "Integrate dream and reality. Intuition grows stronger when rooted in awareness."
  },
  "major_mercury_neptune_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You have poetic perception. Communication blends mystery with meaning, often revealing subtle truths.",
    "growth": "Use your insight in service — through art, counseling, or storytelling."
  },
  "major_mercury_pluto_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your thoughts run deep. You're intense, investigative, and possibly secretive — with a piercing mind.",
    "growth": "Use your mental power to empower, not control. You are here to reveal truth — not to dominate it."
  },
  "major_mercury_pluto_square": {
    "aspect_type": "Square",
    "psychology": "You may experience obsessive thinking or verbal power struggles. Mental control dynamics can emerge.",
    "growth": "Practice mental surrender. Speak to connect, not to conquer."
  },
  "major_mercury_pluto_trine": {
    "aspect_type": "Trine",
    "psychology": "You’re a natural psychological thinker. Insightful, focused, and intense — with the power to transform through words.",
    "growth": "Use your words for healing. Truth spoken with care becomes medicine."
  },
  "major_mercury_pluto_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may attract strong mental opponents or struggle with hidden fears around being misunderstood.",
    "growth": "Speak even when it shakes you. Authenticity breaks inner silence."
  },
  "major_mercury_pluto_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You see beneath the surface with clarity. Your words carry psychological depth and healing potential.",
    "growth": "Guide others gently into insight. You carry torchlight for the shadow."
  },
  "major_chiron_mercury_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your thoughts are shaped by past wounds. You may struggle with expressing pain or feel vulnerable when speaking your truth.",
    "growth": "Let your voice become your medicine. You heal through expression."
  },
  "major_chiron_mercury_square": {
    "aspect_type": "Square",
    "psychology": "Old messages may block your expression. You could fear ridicule or silence yourself out of pain.",
    "growth": "Reclaim your right to speak. The world needs your wounded wisdom."
  },
  "major_chiron_mercury_trine": {
    "aspect_type": "Trine",
    "psychology": "You naturally guide others with your words. You're empathetic, articulate, and carry healing through communication.",
    "growth": "Be the voice you once needed. You transform pain into perspective."
  },
  "major_chiron_mercury_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may attract experiences where your voice feels rejected or misunderstood. Wounding plays out through dialogue.",
    "growth": "Own your story. Every scar in your speech holds light."
  },
  "major_chiron_mercury_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You’re a gentle teacher or mentor. Your words help others name what once hurt.",
    "growth": "Keep speaking with care. You heal through everyday honesty."
  },
  "major_mars_venus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Passion and affection blend. You're magnetic, creative, and expressive in love and desire.",
    "growth": "Channel this intensity with awareness. True attraction grows through conscious direction."
  },
  "major_mars_venus_square": {
    "aspect_type": "Square",
    "psychology": "Tension exists between intimacy and impulse. Relationships may feel like a tug-of-war between desire and harmony.",
    "growth": "Balance assertiveness with empathy. Don’t confuse passion with conflict."
  },
  "major_mars_venus_trine": {
    "aspect_type": "Trine",
    "psychology": "Affection and drive flow together. You’re sensual, charming, and emotionally assertive.",
    "growth": "Use this gift to create — in art, intimacy, and collaboration. You harmonize fire and softness."
  },
  "major_mars_venus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may alternate between craving closeness and needing independence. Attraction may come through polarity.",
    "growth": "Integrate both poles within. Peaceful love doesn’t mean passive love."
  },
  "major_mars_venus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You easily combine charm with initiative. Affection motivates your action and creative spark.",
    "growth": "Let your warmth lead. Relationships flourish when you initiate with care."
  },
  "major_jupiter_venus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Love expands through joy, generosity, and ideals. You attract abundance and value shared beauty.",
    "growth": "Express love wisely. Let your giving come from inner fullness, not approval-seeking."
  },
  "major_jupiter_venus_square": {
    "aspect_type": "Square",
    "psychology": "You may overextend in relationships or indulge to escape discomfort. Love feels larger than life.",
    "growth": "Create structure around pleasure. Balance the heart’s generosity with discernment."
  },
  "major_jupiter_venus_trine": {
    "aspect_type": "Trine",
    "psychology": "A natural romantic and optimist. You believe in love and express it openly and gracefully.",
    "growth": "Use your openness to inspire — not just to attract. Your joy teaches others how to receive."
  },
  "major_jupiter_venus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may over-promise in love or seek fulfillment outside yourself. There’s a pull between indulgence and integrity.",
    "growth": "Let your values guide your desire. Boundaries deepen your capacity for joy."
  },
  "major_jupiter_venus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You're expansive in love and gracious with others. People feel safe around your generosity.",
    "growth": "Direct this energy into creative projects or community love. You’re a vessel for beauty that uplifts."
  },
  "major_jupiter_mars_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Confidence and drive are amplified. You pursue goals boldly and often succeed through sheer momentum.",
    "growth": "Align ambition with values. Purpose fuels power when guided by meaning."
  },
  "major_jupiter_mars_square": {
    "aspect_type": "Square",
    "psychology": "Impulsiveness or overconfidence may lead to overreach. You move fast but not always with direction.",
    "growth": "Channel your energy into long-term goals. Passion matures through patience."
  },
  "major_jupiter_mars_trine": {
    "aspect_type": "Trine",
    "psychology": "You act with optimism and enthusiasm. Your faith in action inspires others.",
    "growth": "Take leadership roles where your energy can spark movement and uplift others."
  },
  "major_jupiter_mars_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may swing between action and excess, assertion and retreat. Bold moves can lead to misalignment.",
    "growth": "Balance inner drive with wisdom. Not all motion is movement."
  },
  "major_jupiter_mars_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Initiative and belief work hand in hand. You take action when inspired and often make bold plans.",
    "growth": "Anchor those plans in real timelines. Dream big, move smart."
  },
  "major_mars_saturn_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your drive is disciplined. You move with intention, building steadily toward your goals.",
    "growth": "Let action become sacred practice. You’re here to master endurance and focus."
  },
  "major_mars_saturn_square": {
    "aspect_type": "Square",
    "psychology": "Internal frustration or blocked ambition can arise. You may struggle with rigid expectations or fear of failure.",
    "growth": "Move slowly but persistently. Pressure becomes strength when expressed with care."
  },
  "major_mars_saturn_trine": {
    "aspect_type": "Trine",
    "psychology": "Effort and discipline harmonize. You work with quiet force and often succeed through consistency.",
    "growth": "Use your strength to mentor others. Your patience is powerful."
  },
  "major_mars_saturn_opposition": {
    "aspect_type": "Opposition",
    "psychology": "A push-pull between drive and doubt. You may hesitate or self-sabotage through inner tension.",
    "growth": "Reframe obstacles as teachers. Action without pressure becomes mastery."
  },
  "major_mars_saturn_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You apply energy with patience. A natural planner, you act efficiently and rarely burn out.",
    "growth": "Help others pace themselves. You build what lasts."
  },
  "major_jupiter_saturn_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You balance optimism with realism. This aspect blends expansion and discipline, often leading to slow, steady growth.",
    "growth": "Honor both your dreams and your structure. Your success is rooted in patient vision."
  },
  "major_jupiter_saturn_square": {
    "aspect_type": "Square",
    "psychology": "You may feel pulled between idealism and caution. Progress feels stalled or delayed by fear of instability.",
    "growth": "Create stable foundations for big visions. Growth is possible when fear and faith collaborate."
  },
  "major_jupiter_saturn_trine": {
    "aspect_type": "Trine",
    "psychology": "You build your dreams with grace. This aspect supports long-term success through a practical, visionary mindset.",
    "growth": "Guide others in building systems that sustain meaning. You’re a planner with purpose."
  },
  "major_jupiter_saturn_opposition": {
    "aspect_type": "Opposition",
    "psychology": "A lifelong dance between risk and responsibility. You may over-correct between freedom and control.",
    "growth": "Learn to trust your timing. Opportunity and caution are not enemies — they’re partners in wise growth."
  },
  "major_jupiter_saturn_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You blend ambition with integrity. Your natural timing supports stable growth, both personally and professionally.",
    "growth": "Be the anchor in shifting tides. Your steady optimism is your gift to the world."
  },
  "major_saturn_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You embody both tradition and revolution. You may feel driven to build new structures from old systems.",
    "growth": "Balance invention with implementation. You’re here to upgrade what’s outlived its purpose."
  },
  "major_saturn_uranus_square": {
    "aspect_type": "Square",
    "psychology": "A tension between stability and change. You may rebel against rules, yet fear chaos.",
    "growth": "Integrate innovation slowly. Freedom is sustainable when built with intention."
  },
  "major_saturn_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "You create change within structure. A natural reformer, you innovate steadily rather than dramatically.",
    "growth": "Design systems that evolve. You make revolution livable."
  },
  "major_saturn_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may feel split between maintaining control and breaking free. This can create dramatic life shifts.",
    "growth": "Build a life where change is included in the plan. Evolve your structure."
  },
  "major_saturn_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You’re able to ground innovation. You bring practical vision to unconventional ideas.",
    "growth": "Support creative thinkers with your steadiness. You're a builder of the future."
  },
  "major_neptune_saturn_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You blend vision with responsibility. Idealism meets structure — spiritual truths can become manifest.",
    "growth": "Make your dreams practical. Devotion and discipline are your allies."
  },
  "major_neptune_saturn_square": {
    "aspect_type": "Square",
    "psychology": "Tension between dreams and doubt. You may question your purpose or feel blocked by vague fears.",
    "growth": "Define your vision and stick with it. Faith builds muscle through trial."
  },
  "major_neptune_saturn_trine": {
    "aspect_type": "Trine",
    "psychology": "You ground your imagination with grace. You're practical in spiritual work and emotionally composed under stress.",
    "growth": "Bring sacredness into the mundane. Your life is a quiet ritual of purpose."
  },
  "major_neptune_saturn_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may wrestle with disillusionment, idealism, or spiritual bypassing. What’s real may feel slippery.",
    "growth": "Rebuild your dream life with patience. Let your inner truth be tested, then trusted."
  },
  "major_neptune_saturn_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You weave spirituality into everyday life. Your dreams are not fantasies — they're blueprints.",
    "growth": "Help others bring heaven to earth. You walk between worlds with humility."
  },
  "major_pluto_saturn_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You carry immense willpower and resilience. This aspect brings a deep sense of duty and transformational leadership potential.",
    "growth": "Reform through presence, not pressure. Your power builds, not breaks."
  },
  "major_pluto_saturn_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with authority, control, or inner tension around ambition. There's a drive to overcome deep obstacles.",
    "growth": "Discipline your intensity. Your legacy depends on what you master — not what you dominate."
  },
  "major_pluto_saturn_trine": {
    "aspect_type": "Trine",
    "psychology": "You possess deep strength and strategic focus. Transformation comes steadily and with precision.",
    "growth": "Lead through quiet certainty. Your inner gravity guides others through darkness."
  },
  "major_pluto_saturn_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may face external resistance that mirrors internal power struggles. Control may be challenged from within or without.",
    "growth": "Learn where to hold on — and where to let go. Mastery begins in surrender."
  },
  "major_pluto_saturn_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You can create lasting transformation. This aspect offers the tools and timing to rebuild deeply.",
    "growth": "Be the architect of healing. You’re here to rebuild the ruins."
  },
  "major_neptune_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You carry visionary energy. This aspect fuses collective dreams with radical change — you're drawn to transcend boundaries.",
    "growth": "Ground your inspiration through consistent practice. Spiritual rebellion requires inner discipline."
  },
  "major_neptune_uranus_square": {
    "aspect_type": "Square",
    "psychology": "Your ideals may conflict with your need for freedom. Spirituality and individuality can feel at odds.",
    "growth": "Integrate the mystical with the practical. Balance revelation with reflection."
  },
  "major_neptune_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "You blend innovation with intuition. You’re a channel for new consciousness and compassionate progress.",
    "growth": "Use your gifts to uplift — through technology, spirituality, or healing arts."
  },
  "major_neptune_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may experience dissonance between the future you envision and the one you're living.",
    "growth": "Clarify your values, then reshape reality. You’re here to reimagine possibility."
  },
  "major_neptune_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Your creative and spiritual ideas flow naturally into new forms. You’re attuned to unseen frequencies.",
    "growth": "Build bridges between the intuitive and the innovative. You’re a dreamer with tools."
  },
  "major_pluto_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You embody the archetype of transformation through disruption. There's a drive to revolutionize power structures.",
    "growth": "Your role is catalytic — refine your force through conscious intent."
  },
  "major_pluto_uranus_square": {
    "aspect_type": "Square",
    "psychology": "You may carry deep tension between rebellion and intensity. Change may come through dramatic breaks.",
    "growth": "Revolution doesn’t always need a bang. Evolve the system from the inside out."
  },
  "major_pluto_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "You create deep transformation with inspired action. Change flows through you like electricity.",
    "growth": "Use your insight to create regenerative systems. You spark evolution without ego."
  },
  "major_pluto_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may experience inner conflict between control and liberation. Others may reflect your urge for freedom.",
    "growth": "Let power become transparency. Your liberation frees others too."
  },
  "major_pluto_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You blend psychological insight with social innovation. You’re tuned to what's ending and what must begin.",
    "growth": "Be a gentle force for collective rebirth. Your clarity is catalytic."
  },
  "major_neptune_pluto_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "This aspect gives you collective vision and psychic depth. You may sense undercurrents that others miss.",
    "growth": "Use your perception with care. Your inner world shapes the outer one."
  },
  "major_neptune_pluto_square": {
    "aspect_type": "Square",
    "psychology": "You may struggle with confusion about control, surrender, or spiritual power.",
    "growth": "Transcend the illusion of control. Your deepest power is your transparency."
  },
  "major_neptune_pluto_trine": {
    "aspect_type": "Trine",
    "psychology": "You possess deep intuitive knowing and a capacity for mystical transformation. You're drawn to the unseen.",
    "growth": "Channel your vision through healing, art, or sacred service."
  },
  "major_neptune_pluto_opposition": {
    "aspect_type": "Opposition",
    "psychology": "There may be inner conflict between surrender and empowerment. Projection may obscure clarity.",
    "growth": "See your shadow with grace. Let inner transformation dissolve illusion."
  },
  "major_neptune_pluto_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You’re attuned to spiritual evolution. Transformation flows through your dreams and creativity.",
    "growth": "Guide others with quiet depth. Your soul remembers how to heal what’s hidden."
  },
  "major_chiron_pluto_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You carry generational wounds around power and transformation. Your pain runs deep but so does your healing ability.",
    "growth": "Your vulnerability is sacred. Alchemy begins in honesty."
  },
  "major_chiron_pluto_square": {
    "aspect_type": "Square",
    "psychology": "You may resist transformation or fear your own strength. Old wounds complicate empowerment.",
    "growth": "Transform without force. Pain softens power into compassion."
  },
  "major_chiron_pluto_trine": {
    "aspect_type": "Trine",
    "psychology": "You are a healing channel for deep psychological insight. Pain has become your spiritual teacher.",
    "growth": "Use your insight to guide others through darkness. You offer rebirth."
  },
  "major_chiron_pluto_opposition": {
    "aspect_type": "Opposition",
    "psychology": "Others may reflect your wounded relationship to power. You attract intensity and seek depth.",
    "growth": "Face what hurts with courage. You’re here to evolve through truth."
  },
  "major_chiron_pluto_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You navigate shadow and healing with wisdom. Transformation is your path of service.",
    "growth": "Support others through their darkest seasons. Your presence is medicine."
  },
  "major_northnode_uranus_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your soul’s evolution is tied to liberation, awakening, and innovation. You're here to challenge norms and catalyze change.",
    "growth": "Be boldly different. Your path isn't to fit in — it's to light up a new direction."
  },
  "major_northnode_uranus_square": {
    "aspect_type": "Square",
    "psychology": "Inner rebellion may block your growth. You may sabotage structure or resist the very change you crave.",
    "growth": "Ground your revolution. Freedom flourishes with direction."
  },
  "major_northnode_uranus_trine": {
    "aspect_type": "Trine",
    "psychology": "Your originality supports your life path. Intuition, brilliance, and progress are natural allies.",
    "growth": "Create from your uniqueness. You evolve the world by being yourself."
  },
  "major_northnode_uranus_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may bounce between radical independence and spiritual stagnation. Restlessness may resist deep growth.",
    "growth": "Liberate yourself inwardly. Real freedom includes emotional sovereignty."
  },
  "major_northnode_uranus_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You have flashes of genius that gently support your evolution. You embody future-minded growth.",
    "growth": "Bring others into your vision. You help society change by simply moving forward."
  },
  "major_neptune_northnode_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "You walk a spiritual karmic path. Mysticism, compassion, and divine service are core to your evolution.",
    "growth": "Bring dreams into reality. Your destiny is not escape — it’s embodiment."
  },
  "major_neptune_northnode_square": {
    "aspect_type": "Square",
    "psychology": "Disillusionment or spiritual bypassing may delay growth. Idealism may cloud purpose.",
    "growth": "Anchor your faith. Real growth needs clarity and commitment, not fantasy."
  },
  "major_neptune_northnode_trine": {
    "aspect_type": "Trine",
    "psychology": "Your intuition and creative gifts align with your path. You naturally channel higher guidance.",
    "growth": "Share your subtle magic. Your softness is part of the awakening."
  },
  "major_neptune_northnode_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may resist your soul path through confusion or escapism. Sensitivity may feel like a burden.",
    "growth": "Trust your inner knowing. Growth comes when you walk through the fog with open eyes."
  },
  "major_neptune_northnode_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Spiritual alignment supports your purpose. You bring divine presence into daily life.",
    "growth": "Let silence guide you. You grow through subtle awareness and soft power."
  },
  "major_northnode_pluto_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your soul’s evolution requires total transformation. You are here to face the shadow and reclaim your power.",
    "growth": "Become who you were afraid to be. Your rebirth is the world’s liberation."
  },
  "major_northnode_pluto_square": {
    "aspect_type": "Square",
    "psychology": "Power struggles and fear of loss may delay your soul path. You may resist letting go of control.",
    "growth": "Surrender the illusion of safety. You were made to rise through intensity."
  },
  "major_northnode_pluto_trine": {
    "aspect_type": "Trine",
    "psychology": "Transformation flows in support of your growth. You guide others through deep evolution.",
    "growth": "Stand in your shadow-light. Your journey awakens the courage in others."
  },
  "major_northnode_pluto_opposition": {
    "aspect_type": "Opposition",
    "psychology": "Old trauma or karmic entanglements may resist your progress. The pull of the past is strong but not your destiny.",
    "growth": "Face what you’ve buried. What you transform becomes your offering."
  },
  "major_northnode_pluto_sextile": {
    "aspect_type": "Sextile",
    "psychology": "Your depth and insight empower your path. You make transformation feel safe, even sacred.",
    "growth": "Lead others through change. You’re the quiet force behind awakening."
  },
  "major_chiron_northnode_conjunction": {
    "aspect_type": "Conjunction",
    "psychology": "Your core wound is the key to your evolution. You're here to walk — and teach — the healing path.",
    "growth": "Let your pain teach you love. Healing is your soul’s curriculum."
  },
  "major_chiron_northnode_square": {
    "aspect_type": "Square",
    "psychology": "Old wounds may block forward motion. Fear of being seen or being hurt can sabotage growth.",
    "growth": "Honor your healing timeline. Even tension is a teacher."
  },
  "major_chiron_northnode_trine": {
    "aspect_type": "Trine",
    "psychology": "You carry healing wisdom that naturally supports your path. Your soul knows how to turn pain into purpose.",
    "growth": "Share your story softly. Your presence heals without effort."
  },
  "major_chiron_northnode_opposition": {
    "aspect_type": "Opposition",
    "psychology": "You may attract mirrors of your pain. Your soul path is found in facing, not fleeing, discomfort.",
    "growth": "Let relationships reflect what needs to evolve. The mirror is your invitation."
  },
  "major_chiron_northnode_sextile": {
    "aspect_type": "Sextile",
    "psychology": "You gently support your soul evolution through emotional healing and wisdom.",
    "growth": "Hold space for yourself first. Then guide others forward with quiet grace."
  },
  "ascendant_dc": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_ic": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_juno": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_jupiter": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_mars": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_midheaven": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_neptune": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_north": {
    "node_quincunx": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_pallas": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_pluto": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_true": {
    "node_quincunx": "[AUTO-PLACEHOLDER]"
  },
  "ascendant_uranus": {
    "quintile": "[AUTO-PLACEHOLDER]"
  },
  "ceres_mars": {
    "semisextile": "[AUTO-PLACEHOLDER]"
  },
  "ceres_mercury": {
    "semisquare": "[AUTO-PLACEHOLDER]"
  },
  "ceres_midheaven": {
    "square": "[AUTO-PLACEHOLDER]"
  },
  "ceres_north": {
    "node_opposition": "[AUTO-PLACEHOLDER]"
  },
  "ceres_saturn": {
    "sesquiquadrate": "[AUTO-PLACEHOLDER]"
  },
  "ceres_sun": {
    "quintile": "[AUTO-PLACEHOLDER]"
  },
  "ceres_true": {
    "node_opposition": "[AUTO-PLACEHOLDER]"
  },
  "ceres_venus": {
    "square": "[AUTO-PLACEHOLDER]"
  },
  "chiron_mercury": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "chiron_neptune": {
    "parallel": "[AUTO-PLACEHOLDER]"
  },
  "chiron_saturn": {
    "contra_parallel": "[AUTO-PLACEHOLDER]",
    "quincunx": "[AUTO-PLACEHOLDER]"
  },
  "chiron_sun": {
    "square": "[AUTO-PLACEHOLDER]"
  },
  "chiron_uranus": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "chiron_vesta": {
    "square": "[AUTO-PLACEHOLDER]"
  },
  "dc_jupiter": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "dc_mars": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "dc_midheaven": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "dc_neptune": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "dc_pluto": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "ic_mars": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "ic_mercury": {
    "semisquare": "[AUTO-PLACEHOLDER]"
  },
  "ic_midheaven": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "ic_neptune": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "ic_north": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "ic_pluto": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "ic_saturn": {
    "semisquare": "[AUTO-PLACEHOLDER]"
  },
  "ic_true": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "ic_venus": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "juno_mars": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "juno_mercury": {
    "semisquare": "[AUTO-PLACEHOLDER]"
  },
  "juno_midheaven": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "juno_neptune": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "juno_north": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "juno_pluto": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "juno_saturn": {
    "semisquare": "[AUTO-PLACEHOLDER]"
  },
  "juno_true": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "juno_venus": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "jupiter_neptune": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "jupiter_south": {
    "node_biquintile": "[AUTO-PLACEHOLDER]"
  },
  "jupiter_sun": {
    "quintile": "[AUTO-PLACEHOLDER]"
  },
  "jupiter_vesta": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "mars_mercury": {
    "quintile": "[AUTO-PLACEHOLDER]"
  },
  "mars_midheaven": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "mars_neptune": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "mars_north": {
    "node_quincunx": "[AUTO-PLACEHOLDER]"
  },
  "mars_pallas": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "mars_pluto": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "mars_south": {
    "node_semisextile": "[AUTO-PLACEHOLDER]"
  },
  "mars_true": {
    "node_quincunx": "[AUTO-PLACEHOLDER]"
  },
  "mars_venus": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "mercury_midheaven": {
    "sesquiquadrate": "[AUTO-PLACEHOLDER]"
  },
  "mercury_moon": {
    "parallel": "[AUTO-PLACEHOLDER]",
    "square": "[AUTO-PLACEHOLDER]"
  },
  "mercury_north": {
    "node_sesquiquadrate": "[AUTO-PLACEHOLDER]"
  },
  "mercury_pallas": {
    "quintile": "[AUTO-PLACEHOLDER]"
  },
  "mercury_pluto": {
    "quintile": "[AUTO-PLACEHOLDER]"
  },
  "mercury_saturn": {
    "square": "[AUTO-PLACEHOLDER]"
  },
  "mercury_south": {
    "node_semisquare": "[AUTO-PLACEHOLDER]"
  },
  "mercury_true": {
    "node_sesquiquadrate": "[AUTO-PLACEHOLDER]"
  },
  "mercury_uranus": {
    "conjunction": "[AUTO-PLACEHOLDER]",
    "parallel": "[AUTO-PLACEHOLDER]"
  },
  "mercury_venus": {
    "contra_parallel": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_neptune": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_north": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_pallas": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_pluto": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_saturn": {
    "sesquiquadrate": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_south": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_true": {
    "node_square": "[AUTO-PLACEHOLDER]"
  },
  "midheaven_venus": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "moon_saturn": {
    "opposition": "[AUTO-PLACEHOLDER]"
  },
  "moon_sun": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "moon_uranus": {
    "parallel": "[AUTO-PLACEHOLDER]",
    "square": "[AUTO-PLACEHOLDER]"
  },
  "moon_venus": {
    "contra_parallel": "[AUTO-PLACEHOLDER]"
  },
  "neptune_saturn": {
    "contra_parallel": "[AUTO-PLACEHOLDER]"
  },
  "neptune_sun": {
    "semisquare": "[AUTO-PLACEHOLDER]"
  },
  "north_node": {
    "pallas_quincunx": "[AUTO-PLACEHOLDER]",
    "saturn_semisquare": "[AUTO-PLACEHOLDER]",
    "south_node_opposition": "[AUTO-PLACEHOLDER]",
    "true_node_conjunction": "[AUTO-PLACEHOLDER]",
    "true_node_parallel": "[AUTO-PLACEHOLDER]",
    "venus_square": "[AUTO-PLACEHOLDER]"
  },
  "pallas_pluto": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "pallas_true": {
    "node_quincunx": "[AUTO-PLACEHOLDER]"
  },
  "pallas_venus": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "pluto_venus": {
    "trine": "[AUTO-PLACEHOLDER]"
  },
  "saturn_south": {
    "node_sesquiquadrate": "[AUTO-PLACEHOLDER]"
  },
  "saturn_sun": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "saturn_true": {
    "node_semisquare": "[AUTO-PLACEHOLDER]"
  },
  "saturn_uranus": {
    "square": "[AUTO-PLACEHOLDER]"
  },
  "saturn_vesta": {
    "sextile": "[AUTO-PLACEHOLDER]"
  },
  "south_node": {
    "sun_quintile": "[AUTO-PLACEHOLDER]",
    "true_node_opposition": "[AUTO-PLACEHOLDER]",
    "venus_square": "[AUTO-PLACEHOLDER]"
  },
  "sun_uranus": {
    "semisextile": "[AUTO-PLACEHOLDER]"
  },
  "sun_vesta": {
    "conjunction": "[AUTO-PLACEHOLDER]"
  },
  "true_node": {
    "venus_square": "[AUTO-PLACEHOLDER]"
  },
  "uranus_venus": {
    "contra_parallel": "[AUTO-PLACEHOLDER]",
    "sextile": "[AUTO-PLACEHOLDER]"
  }
}