{
  "sign_interpretations": {
    "Aries": "Lilith in Aries reflects raw, untamed independence and a refusal to be subdued. There may be a hidden wound around asserting oneself or being seen as 'too much.' Empowerment comes through embracing instinct without apology.",
    "Taurus": "Lilith in Taurus speaks to suppressed desires for sensual pleasure and material safety. There may be guilt around indulgence or needing control. Healing involves reclaiming the right to enjoy embodiment and trust one's values.",
    "Gemini": "Lilith in Gemini can express as rebellion through words, wit, or intellectual nonconformity. There may be a fear of being misunderstood or silenced. Integration comes from honoring your voice without needing validation.",
    "Cancer": "Lilith in Cancer reflects emotional self-protection and fear of vulnerability. It can surface as tension between care and control. True security arises when nurturing is rooted in self-trust, not obligation.",
    "Leo": "Lilith in Leo represents the shadow of visibility — pride, performance, and fear of being seen as 'too much.' This placement asks for radical self-expression without performance. It reclaims joy from external approval.",
    "Virgo": "Lilith in Virgo points to perfectionism, body shame, or suppressed critique. It can manifest as self-denial or control over one’s environment. Wholeness emerges through honoring imperfection and trusting intuition.",
    "Libra": "Lilith in Libra may show up as a conflict between pleasing others and owning one’s truth. The shadow lies in performative harmony. Empowerment begins with authentic relating, even when it disrupts balance.",
    "Scorpio": "Lilith in Scorpio brings deep emotional intensity, secrecy, and magnetism. There may be fear around vulnerability or control in intimacy. Liberation is found by embracing emotional truth and trusting transformation.",
    "Sagittarius": "Lilith in Sagittarius challenges boundaries around belief and truth-telling. It may show up as dogma, avoidance, or wanderlust as escape. Empowerment comes from walking your truth without needing consensus.",
    "Capricorn": "Lilith in Capricorn hides in over-control, stoicism, or suppressed ambition. There may be fear of failure or resentment of authority. Growth comes through reclaiming inner sovereignty and sustainable self-leadership.",
    "Aquarius": "Lilith in Aquarius speaks to the shadow of alienation, rebellion, and eccentricity. It may reject group norms out of trauma. Healing happens through authentic belonging — not rejection or assimilation.",
    "Pisces": "Lilith in Pisces reveals spiritual longing, escapism, or martyrdom patterns. There may be confusion around boundaries or identity. Wholeness is reclaimed through compassionate clarity and grounded mysticism."
  },
  "house_interpretations": {
    "1": "Lilith in the 1st House often points to an intense, magnetic presence and a complex relationship with visibility. Others may project taboo qualities onto you. Empowerment involves embracing the raw authenticity of your self-expression.",
    "2": "Lilith in the 2nd House reflects hidden issues around self-worth, money, and bodily autonomy. There may be shame or secrecy about desires and values. Growth comes from honoring your needs without guilt.",
    "3": "Lilith in the 3rd House suggests shadow in communication — secrecy, sarcasm, or feeling unheard. The healing path is reclaiming your voice and expressing complex truths without fear of judgment.",
    "4": "Lilith in the 4th House may manifest as ancestral wounds, emotional repression, or feeling unsafe in vulnerability. Liberation involves reclaiming your right to feel deeply and create your own definition of 'home.'",
    "5": "Lilith in the 5th House reveals suppressed creativity, sexuality, or shame around being seen. There may be fear of ridicule or punishment for joyful expression. Healing means reclaiming play, art, and pleasure as sacred.",
    "6": "Lilith in the 6th House speaks to tension around control, routine, or body perfectionism. The shadow often hides in overwork or self-denial. Empowerment means listening to the body and dissolving guilt through presence.",
    "7": "Lilith in the 7th House reflects intense, often unspoken dynamics in relationships. Power struggles or taboo projections may occur. The path forward involves owning your relational needs without apology.",
    "8": "Lilith in the 8th House reveals themes of eroticism, death, and emotional power. There may be secrecy or fear of surrender. Transformation comes through conscious intimacy and fearless emotional honesty.",
    "9": "Lilith in the 9th House suggests rebellion against dogma or identity suppression through belief systems. Liberation is found in exploring truth through your own lens — even if it disrupts inherited paradigms.",
    "10": "Lilith in the 10th House can indicate shadow around success, authority, or public identity. There may be fear of visibility or judgment. Healing emerges through authentic ambition and self-directed legacy.",
    "11": "Lilith in the 11th House points to rejection, outsider identity, or tension in groups. The shadow may resist belonging or over-identify with rebellion. Empowerment comes from conscious community and chosen kinship.",
    "12": "Lilith in the 12th House holds deep unconscious material — spiritual exile, psychic overwhelm, or karmic themes. Healing unfolds through gentle integration, solitude, and honoring invisible truths."
  }
}
