{
  "sign_interpretations": {
    "Aries": "Chiron in Aries reveals a wound around identity, courage, and the right to assert oneself. Healing emerges through reclaiming initiative and developing a healthy sense of self without needing to prove worth.",
    "Taurus": "Chiron in Taurus speaks to pain around safety, stability, or self-worth. This placement may fear loss or inadequacy. The path forward involves grounding in self-trust and learning that your value is innate, not earned.",
    "Gemini": "Chiron in Gemini reflects a wound of communication or being misunderstood. There may be anxiety around speaking truth or feeling scattered. Healing comes through integrating voice and mind, learning to express with confidence.",
    "Cancer": "Chiron in Cancer often centers on emotional safety, family patterns, or feeling unseen. There may be sensitivity around nurturing and vulnerability. True healing involves reclaiming inner sanctuary and feeling at home within oneself.",
    "Leo": "Chiron in Leo highlights wounds around self-expression, creativity, or recognition. One may fear being seen or feel undeserving of attention. Healing arises through joyful expression without fear of judgment.",
    "Virgo": "Chiron in Virgo may manifest as wounds around competence, health, or perfectionism. There may be a fear of not being useful or good enough. Wholeness is reclaimed through compassionate self-acceptance and trusting the process.",
    "Libra": "Chiron in Libra can reflect pain in relationships, fairness, or self-worth in the eyes of others. There may be a tendency to over-give or fear rejection. Healing begins with finding balance and validating one’s own needs.",
    "Scorpio": "Chiron in Scorpio reveals deep, transformative wounds around trust, intimacy, and control. There may be fear of betrayal or emotional intensity. Liberation comes through conscious vulnerability and embracing inner power.",
    "Sagittarius": "Chiron in Sagittarius may present as a wound around belief, purpose, or freedom. One might fear expansion or question their philosophical compass. Healing unfolds through trusting personal truth and the courage to explore.",
    "Capricorn": "Chiron in Capricorn reflects pain around authority, responsibility, or achievement. There may be self-doubt or fear of failure. True healing comes from inner validation and rewriting success on your own terms.",
    "Aquarius": "Chiron in Aquarius may reveal wounds of alienation, group rejection, or feeling too different. The gift lies in embracing your unique vision and contributing to community without losing authenticity.",
    "Pisces": "Chiron in Pisces centers on wounds of dissolution, martyrdom, or escapism. There may be difficulty with boundaries or trusting one's intuition. Healing involves spiritual integration and grounded compassion."
  },
  "house_interpretations": {
    "1": "Chiron in the 1st House suggests a visible wound around identity or self-image. There may be discomfort in being seen or initiating. Healing comes through radical self-acceptance and leading from experience.",
    "2": "Chiron in the 2nd House can reflect pain around money, value, or physical security. There may be patterns of scarcity or low self-worth. Growth involves rebuilding a sense of internal stability and resourcefulness.",
    "3": "Chiron in the 3rd House shows sensitivity in communication, learning, or early sibling dynamics. There may be anxiety about being heard. Healing comes from trusting your voice and mental curiosity.",
    "4": "Chiron in the 4th House points to ancestral or emotional wounds linked to home, family, or feeling safe. Integration involves redefining belonging and healing the roots within.",
    "5": "Chiron in the 5th House brings wounds around creativity, play, or recognition. There may be fear of self-expression. Healing unfolds through joyful creativity and authentic visibility.",
    "6": "Chiron in the 6th House relates to work, service, or health vulnerabilities. It may manifest as guilt, burnout, or self-criticism. Healing requires honoring rhythm, imperfection, and embodied care.",
    "7": "Chiron in the 7th House highlights relationship wounds and projection patterns. There may be difficulty in trust or reciprocity. Growth involves owning your part and rewriting partnership dynamics.",
    "8": "Chiron in the 8th House touches trauma, shared resources, or deep intimacy fears. It may carry transgenerational pain. Healing arises through conscious transformation and emotional resilience.",
    "9": "Chiron in the 9th House may involve spiritual injury, cultural displacement, or belief wounds. There may be fear of being wrong or lost. Healing comes by exploring meaning through direct experience.",
    "10": "Chiron in the 10th House reflects wounds around achievement, legacy, or public image. There may be a struggle for recognition. Healing begins with self-defined success and internal authority.",
    "11": "Chiron in the 11th House points to pain around belonging, friendships, or ideals. There may be a fear of not fitting in. Healing emerges from finding your true community and role in the collective.",
    "12": "Chiron in the 12th House reveals unconscious wounds, hidden fears, or spiritual loss. It often involves self-sabotage or isolation. Healing occurs through dreamwork, solitude, and sacred inner work."
  }
}
