{
  "Aries": "Aries Rising projects confidence, courage, and drive. These individuals often lead instinctively and prefer action to deliberation. They may come across as assertive or impulsive, with a need to move independently.",
  "Taurus": "Taurus Rising expresses steadiness, sensuality, and calm presence. They often carry a grounded, earthy beauty and can be perceived as dependable or resistant to change.",
  "Gemini": "Gemini Rising gives a quick, curious, and communicative presence. These individuals often come across as adaptable, witty, and mentally agile — with a tendency to seek stimulation and variety.",
  "Cancer": "Cancer Rising exudes emotional sensitivity, protection, and warmth. Others may see them as nurturing or moody. They tend to lead with empathy and retreat when emotionally overwhelmed.",
  "Leo": "Leo Rising shines with charisma, creativity, and bold expression. There's a natural confidence and a desire to be seen, appreciated, or lead through heart-centered presence.",
  "Virgo": "Virgo Rising conveys thoughtfulness, precision, and humility. They may appear observant or analytical, with a focus on being useful, healthy, or refined in their interactions.",
  "Libra": "Libra Rising brings beauty, diplomacy, and sociability to the surface. These individuals are often perceived as gracious, poised, and harmony-seeking — though sometimes overly accommodating.",
  "Scorpio": "Scorpio Rising emanates intensity, depth, and emotional magnetism. There’s an air of mystery or power, often with strong boundaries and perceptive awareness.",
  "Sagittarius": "Sagittarius Rising radiates optimism, freedom, and expansive energy. These individuals often seem adventurous, philosophical, and eager to explore life’s meaning.",
  "Capricorn": "Capricorn Rising projects responsibility, authority, and ambition. They may appear serious or composed, often maturing quickly and setting long-term goals early on.",
  "Aquarius": "Aquarius Rising brings originality, intellect, and detachment. Others may see them as progressive, eccentric, or uniquely attuned to future trends and social causes.",
  "Pisces": "Pisces Rising offers softness, imagination, and compassion. These individuals may be dreamy, sensitive, or hard to pin down — often absorbing moods and images from their surroundings.",
  "ascendant_sign": {
    "sagittarius": "[AUTO-PLACEHOLDER]"
  }
}